oc-ece-mesa/mesa-basalt/arduino-ide-board/variant.h
#pragma once

#define PA1     PIN_A1
#define PA2     PIN_A2
#define PA3     PIN_A3
#define PA4     PIN_A4
#define PA5     PIN_A5
#define PA6     PIN_A6
#define PA7     PIN_A7
#define PA8     PIN_A8
#define PB6     19
#define PB7     20
#define PC15    24

#define PINS_COUNT        11
#define NUM_DIGITAL_PINS  11
#define NUM_ANALOG_INPUTS 8

#define PIN_SERIAL_RX
#define PIN_SERIAL_TX

#define PIN_SPI_SS
#define PIN_SPI_MOSI
#define PIN_SPI_MISO
#define PIN_SPI_SCK

#define PIN_WIRE_SDA    PA6
#define PIN_WIRE_SCL    PA7
